backend-api/app/Controllers/Api/AuthController.php

    public function login()
    {
        // Mengambil data JSON mentah yang dikirim oleh Axios frontend
        $json = $this->request->getJSON();

        // Ambil property jika data JSON berhasil dikirim, jika tidak fallback ke getVar
        $username = isset($json->username) ? trim($json->username) : trim($this->request->getVar('username') ?? '');
        $password = isset($json->password) ? trim($json->password) : trim($this->request->getVar('password') ?? '');

        // Validasi awal jika input kosong
        if (empty($username) || empty($password)) {
            return $this->respond([
                'status'   => 400,
                'error'    => 'Bad Request',
                'messages' => [
                    'error' => 'Username dan password wajib diisi.'
                ]
            ], 400);
        }

        $model = model('App\\Models\\UserModel');
        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'bismillahip4'
 LIMIT 1

            // PENGAMAN: Cek dulu apakah model UserModel punya kolom 'token' di properti $allowedFields
            if (in_array('token', $model->allowedFields)) {
                try {
                    $model->update($user['id'], ['token' => $token]);
---
UPDATE `users` SET `token` = 'ohxXOc7z+3Dlb3ozhn0TtyXowU/wSMIR7EPZ5Dg96DY='
WHERE `users`.`id` IN ('12')