backend-api/app/Controllers/Api/BarangController.php

SELECT *
FROM `users`
WHERE `token` = '3iVi9ulZik3UWKOzM0xXjeu6fTsdzr5t4mjBGORvrLU='
---
    private function getCurrentUser()
    {
        $authHeader = $this->request->getServer('HTTP_AUTHORIZATION');
        if ($authHeader && preg_match('/Bearer\s(\S+)/', $authHeader, $matches)) {
            $token = $matches[1];
            $db = \Config\Database::connect();
            return $db->table('users')->getWhere(['token' => $token])->getRow();

INSERT INTO `barang` (`kode_barang`, `nama_barang`, `kategori_id`, `supplier_id`, `stok`, `harga`, `user_id`) VALUES ('BRG-ELK-001', 'Testuser1 Laptop', 1, 1, 5, 5000000, 13)
---
    public function create()
    {
        $user = $this->getCurrentUser();
        if (!$user) {
            return $this->failUnauthorized('Akses ditolak.');
        }

        $model = new BarangModel();
        $data = $this->request->getJSON(true);
        $data['user_id'] = (int)$user->id;

        if ($model->insert($data)) {