backend-api/app/Controllers/Api/Register.php

SELECT *
FROM `users`
WHERE `username` = 'bismillahip4'
 LIMIT 1
---
    public function index()
    {
        // 1. Ambil input JSON dari Vue.js / Axios
        $json = $this->request->getJSON();

        if ($json) {
            $username = $json->username ?? null;
            $password = $json->password ?? null;
        } else {
            $username = $this->request->getVar('username');
            $password = $this->request->getVar('password');
        }

        // 2. Validasi Input Sederhana
        if (empty($username) || empty($password)) {
            return $this->failValidationErrors([
                'error' => 'Username dan Password wajib diisi!'
            ]);
        }

        // 3. Cek apakah username sudah terdaftar
        $userModel = new UserModel();
        $userLama = $userModel->where('username', $username)->first();

INSERT INTO `users` (`username`, `password`, `token`) VALUES ('bismillahip4', '$2y$12$t90SvglM6kf4U1QgvT5equfJ5k0eKZz9VHVf0xKnfKu89DTqOWjMC', NULL)
---
        ];

        // 5. Simpan ke Database
        if ($userModel->insert($dataStore)) {