backend-api/app/Models/BarangModel.php

SELECT `barang`.*, `kategori`.`nama_kategori`, `supplier`.`nama_supplier`
FROM `barang`
LEFT JOIN `kategori` ON `kategori`.`id` = `barang`.`kategori_id`
LEFT JOIN `supplier` ON `supplier`.`id` = `barang`.`supplier_id`
WHERE `barang`.`user_id` = 1
---
    public function getBarangLengkap(int $userId)
    {
        return $this->select('barang.*, kategori.nama_kategori, supplier.nama_supplier')
                    ->join('kategori', 'kategori.id = barang.kategori_id', 'left')
                    ->join('supplier', 'supplier.id = barang.supplier_id', 'left')
                    ->where('barang.user_id', $userId)
                    ->findAll();