backend-api/app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        // Ambil header Authorization dari HTTP Request
        $authHeader = $request->getServer('HTTP_AUTHORIZATION');

        if (!$authHeader || !preg_match('/Bearer\s(\S+)/', $authHeader, $matches)) {
            $response = service('response');
            $response->setStatusCode(401);
            return $response->setJSON([
                'status' => 401,
                'error' => 'Unauthorized',
                'messages' => 'Akses ditolak. Token Authorization Bearer tidak ditemukan.'
            ]);
        }

        $token = $matches[1];
        $db = \Config\Database::connect();
        $user = $db->table('users')->getWhere(['token' => $token])->getRow();
---
SELECT *
FROM `users`
WHERE `token` = '3iVi9ulZik3UWKOzM0xXjeu6fTsdzr5t4mjBGORvrLU='